export const data = [
    {
        id: 1,
        theme: 'Музыка',
        fromDate: 1980,
        toDate: 1986,
        fields: [
            { year: '1980', fact: 'Рок-группа AC/DC выпустила альбом "Back in Black", который стал одним из самых продаваемых альбомов всех времен.' },
            { year: '1981', fact: 'Британская группа Queen выпустила альбом "Greatest Hits", который стал одним из самых успешных сборников в истории музыки.' },
            { year: '1982', fact: 'Майкл Джексон выпустил альбом "Thriller", который стал самым продаваемым альбомом всех времен.' },
            { year: '1983', fact: 'Вышел альбом группы The Police "Synchronicity", включавший хиты "Every Breath You Take" и "King of Pain".' },
            { year: '1984', fact: 'Вышел альбом группы Prince "Purple Rain", который стал одним из самых влиятельных альбомов 1980-х годов.' },
            { year: '1985', fact: 'Вышел альбом Dire Straits "Brothers in Arms", который стал первым альбомом, записанным полностью на CD.' },
            { year: '1986', fact: 'Вышел альбом группы Metallica "Master of Puppets", который стал одним из самых значимых альбомов в истории хэви-метала.' }
        ]
    },
    {
        id: 2,
        theme: 'Кино',
        fromDate: 1987,
        toDate: 1991,
        fields: [
            { year: '1987', fact: '«Хищник» американский фантастический боевик, снятый Джоном Мактирнаном.' },
            { year: '1988', fact: '«Кто подставил кролика Роджера» — американский комедийный анимационно-игровой фильм режиссёра Роберта Земекиса' },
            { year: '1989', fact: '«Назад в бу́дущее 2» — научно-фантастический фильм режиссёра Роберта Земекиса по сценарию Боба Гейла, вторая часть трилогии «Назад в будущее»' },
            { year: '1990', fact: '«Крепкий орешек 2» — американский остросюжетный боевик 1990 года и вторая лента франшизы «Крепкий орешек»' }
        ]
    },
    {
        id: 3,
        theme: 'Литература',
        fromDate: 1992,
        toDate: 1997,
        fields: [
            { year: '1992', fact: 'Харуки Мураками опубликовал роман "Юпитерово сияние", который принёс ему широкую известность.' },
            { year: '1993', fact: 'Вышла книга Джона Гришэма "Клиент", ставшая бестселлером и получившая экранизацию.' },
            { year: '1994', fact: 'Анна Гавальда опубликовала свой первый роман "Жена жреца", который принёс ей мировую известность.' },
            { year: '1995', fact: 'Вышла первая книга о Гарри Поттере - "Гарри Поттер и философский камень", написанная Дж. К. Роулинг.' },
            { year: '1996', fact: 'Джон Гришэм опубликовал роман "Метр", который стал одним из его самых популярных произведений.' },
            { year: '1997', fact: 'Вышла книга Джоан Роулинг "Гарри Поттер и Кубок огня", четвёртая книга о Гарри Поттере в серии.' }
        ]
    },
    {
        id: 4,
        theme: 'Спорт',
        fromDate: 1999,
        toDate: 2004,
        fields: [
            { year: '1999', fact: 'В 1999 году Ланс Армстронг выиграл свою первую Тур де Франс из последующих семи побед.' },
            { year: '2000', fact: 'Сборная Франции выиграла Евро-2000 по футболу, победив в финале сборную Италии.' },
            { year: '2001', fact: 'Майкл Шумахер стал пилотом Формулы-1 с наибольшим количеством побед за всю историю этого чемпионата.' },
            { year: '2002', fact: 'Сборная Бразилии выиграла Чемпионат мира по футболу, обыграв в финале сборную Германии.' },
            { year: '2003', fact: 'Тайгер Вудс выиграл впервые Тур чемпионов и стал самым молодым гольфистом, завоевавшим все четыре турнира Grand Slam.' },
            { year: '2004', fact: 'В 2004 году Майкл Фелпс выиграл шесть золотых медалей на летних Олимпийских играх в Афинах, установив множество новых рекордов.' }
        ]
    },
    {
        id: 5,
        theme: 'Технологии',
        fromDate: 2005,
        toDate: 2014,
        fields: [
            { year: '2005', fact: 'В 2005 году компания Apple выпустила первое поколение iPod Nano, который стал одним из самых популярных портативных медиаплееров.' },
            { year: '2006', fact: 'Компания Twitter была запущена в марте 2006 года и быстро стала одним из самых популярных микроблогов в мире.' },
            { year: '2007', fact: 'Apple представила iPhone в 2007 году, введя революционное смартфонное устройство с сенсорным экраном и множеством функций.' },
            { year: '2008', fact: 'В 2008 году Google запустила свою операционную систему для мобильных устройств Android, которая стала одной из самых популярных в мире.' },
            { year: '2009', fact: 'В 2009 году Microsoft выпустила операционную систему Windows 7, которая стала одной из самых успешных версий Windows.' },
            { year: '2010', fact: 'В 2010 году компания Apple выпустила iPad, открыв новую эру в рынке планшетных компьютеров.' },
            { year: '2011', fact: 'IBM создала искусственный интеллект Watson, который победил на игре Jeopardy!, демонстрируя потенциал искусственного интеллекта.' },
            { year: '2012', fact: 'Компания SpaceX, основанная Илоном Маском, отправила первый коммерческий космический корабль на Международную космическую станцию.' },
            { year: '2013', fact: 'Google Glass были представлены в 2013 году, открывая новую эру носимых компьютеров и дополненной реальности.' },
            { year: '2014', fact: 'Facebook приобрел WhatsApp за рекордные 19 миллиардов долларов, укрепляя своё присутствие в мире мобильных коммуникаций.' }
        ]
    },
    {
        id: 6,
        theme: 'Наука',
        fromDate: 2015,
        toDate: 2022,
        fields: [
            { year: '2015', fact: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды' },
            { year: '2016', fact: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11' },
            { year: '2017 ', fact: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi' },
            { year: '2017 ', fact: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi' }
        ]
    },
];

const getDataById = (id) => {
    const foundItem = data.find(item => item.id === id);
    return foundItem ? foundItem : null;
};

export default getDataById;